[go to notebook](http://localhost:8888/notebooks/scripts/15.ipynb)

In [1]:
import pandas as pd
pd.set_option('display.max_rows', 4)
from IPython.display import display

In [2]:
drinks = pd.read_csv('../data/drinks.csv')
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
...,...,...,...,...,...,...
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

In [3]:
drinks.dtypes

country                          object
beer_servings                     int64
                                 ...
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [4]:
# astype: change column type
drinks['beer_servings'] = drinks.beer_servings.astype(float)
drinks.dtypes

country                          object
beer_servings                   float64
                                 ...
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [5]:
# change column type when reading data
drinks = pd.read_csv('../data/drinks.csv', dtype={'beer_servings':float})
drinks.dtypes

country                          object
beer_servings                   float64
                                 ...
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [6]:
orders = pd.read_table('../data/chipotle.tsv')
orders

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
...,...,...,...,...,...
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [7]:
# check column types
orders.dtypes

order_id               int64
quantity               int64
                       ...
choice_description    object
item_price            object
dtype: object

In [8]:
orders.item_price.str.replace('$', '').astype(float).mean()

7.4643357853742973

In [9]:
orders.item_name.str.contains('Chicken')

0       False
1       False
        ...
4620     True
4621     True
Name: item_name, dtype: bool

In [10]:
# convert boolean to int
orders.item_name.str.contains('Chicken').astype(int)

0       0
1       0
       ..
4620    1
4621    1
Name: item_name, dtype: int64